const Terms = () => {
  return (
    <section className="max-w-7xl m-auto mt-5 p-5 md:px-10 bg-white rounded-lg shadow-md">
      <h1 className="text-2xl font-bold mb-4">
        Общи условия за ползване на онлайн магазин за тениски
      </h1>

      <section className="mb-4">
        <h2 className="text-xl font-semibold">1. Въведение</h2>
        <p>
          Тези общи условия регулират използването на онлайн магазина за тениски
          (наричан по-долу &quot;магазинът&quot;). С регистрирането си в
          магазина, Вие приемате тези условия.
        </p>
      </section>

      <section className="mb-4">
        <h2 className="text-xl font-semibold">2. Регистрация</h2>
        <p>
          За да пазарувате в магазина, е необходимо да се регистрирате. При
          регистрация е задължително да предоставите следната информация:
        </p>
        <ul className="list-disc pl-5">
          <li>Име</li>
          <li>Фамилия</li>
          <li>Имейл адрес</li>
        </ul>
        <p>
          Регистрацията е безплатна и дава достъп до специални оферти и
          промоции.
        </p>
      </section>

      <section className="mb-4">
        <h2 className="text-xl font-semibold">3. Защита на личните данни</h2>
        <p>
          Магазинът се ангажира да защитава вашите лични данни и да ги използва
          единствено за целите на обработка на поръчки и комуникация с вас.
          Вашата информация няма да бъде предоставяна на трети лица без ваше
          съгласие.
        </p>
      </section>

      <section className="mb-4">
        <h2 className="text-xl font-semibold">4. Поръчки и плащане</h2>
        <p>
          След регистрация можете да правите поръчки в магазина. Всички цени са
          окончателни и включват ДДС. Плащането може да се извърши чрез
          кредитна/дебитна карта или наложен платеж.
        </p>
      </section>

      <section className="mb-4">
        <h2 className="text-xl font-semibold">5. Доставка</h2>
        <p>
          Доставката на поръчките се извършва в срок от [въведете срок] работни
          дни след потвърждение на поръчката. Разходите за доставка са за сметка
          на клиента.
        </p>
      </section>

      <section className="mb-4">
        <h2 className="text-xl font-semibold">6. Връщане на стоки</h2>
        <p>
          Имате право да върнете закупените стоки в срок от 14 дни след
          получаването им. Стоките трябва да бъдат в оригиналната си опаковка и
          ненарушени.
        </p>
      </section>

      <section className="mb-4">
        <h2 className="text-xl font-semibold">7. Промени в общите условия</h2>
        <p>
          Магазинът си запазва правото да изменя тези общи условия. Всяка
          промяна ще бъде публикувана на сайта и ще влезе в сила от момента на
          публикуване.
        </p>
      </section>

      <section className="mb-4">
        <h2 className="text-xl font-semibold">8. Контакти</h2>
        <p>
          За въпроси и запитвания можете да се свържете с нас на имейл: [вашият
          имейл].
        </p>
      </section>

      <section>
        <h2 className="text-xl font-semibold">9. Заключителни разпоредби</h2>
        <p>
          С регистрирането си в магазина, вие потвърдихте, че сте прочели и
          разбрали тези общи условия и се съгласявате с тях.
        </p>
      </section>
    </section>
  );
};
export default Terms;
